In [1]:
pip install pysql

Collecting pysql
  Using cached pysql-0.16.tar.gz (127 kB)
  Installing build dependencies: started
  Installing build dependencies: finished with status 'done'
  Getting requirements to build wheel: started
  Getting requirements to build wheel: finished with status 'error'
Note: you may need to restart the kernel to use updated packages.

  error: subprocess-exited-with-error

  Getting requirements to build wheel did not run successfully.
  exit code: 1

  [25 lines of output]
  Traceback (most recent call last):
    File "C:\Users\abhiraj\AppData\Local\Programs\Python\Python313\Lib\site-packages\pip\_vendor\pyproject_hooks\_in_process\_in_process.py", line 389, in <module>
      main()
      ~~~~^^
    File "C:\Users\abhiraj\AppData\Local\Programs\Python\Python313\Lib\site-packages\pip\_vendor\pyproject_hooks\_in_process\_in_process.py", line 373, in main
      json_out["return_val"] = hook(**hook_input["kwargs"])
                               ~~~~^^^^^^^^^^^^^^^^^^^^^^^^
    File "C:\Users\abhiraj\AppData\Local\Programs\Python\Python313\Lib\site-packages\pip\_vendor\pyproject_hooks\_in_process\_in_process.py", line 143, in get_requires_for_build_wheel
      return hook(config_settings)
    File "C:\Users\abhiraj\AppData\Local\Temp\pip-build-env-0h6wll5x\overlay\Lib\site-packages\setuptools\build_meta.py", line 331, in get_requires_for_build_wheel
      return self._get_build_requires(config_settings, requirements=[])
             ~~~~~~~~~~~~~~~~~~~~~~~~^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
    File "C:\Users\abhiraj\AppData\Local\Temp\pip-build-env-0h6wll5x\overlay\Lib\site-packages\setuptools\build_meta.py", line 301, in _get_build_requires
      self.run_setup()
      ~~~~~~~~~~~~~~^^
    File "C:\Users\abhiraj\AppData\Local\Temp\pip-build-env-0h6wll5x\overlay\Lib\site-packages\setuptools\build_meta.py", line 512, in run_setup
      super().run_setup(setup_script=setup_script)
      ~~~~~~~~~~~~~~~~~^^^^^^^^^^^^^^^^^^^^^^^^^^^
    File "C:\Users\abhiraj\AppData\Local\Temp\pip-build-env-0h6wll5x\overlay\Lib\site-packages\setuptools\build_meta.py", line 317, in run_setup
      exec(code, locals())
      ~~~~^^^^^^^^^^^^^^^^
    File "<string>", line 31
      except Exception, e:
             ^^^^^^^^^^^^
  SyntaxError: multiple exception types must be parenthesized
  [end of output]

  note: This error originates from a subprocess, and is likely not a problem with pip.

[notice] A new release of pip is available: 25.1.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip
error: subprocess-exited-with-error

Getting requirements to build wheel did not run successfully.
exit code: 1

See above for output.

note: This error originates from a subprocess, and is likely not a problem with pip.

In [2]:
pip install PyMySQL

Requirement already satisfied: PyMySQL in c:\users\abhiraj\appdata\local\programs\python\python313\lib\site-packages (1.1.2)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.1.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [3]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\abhiraj\appdata\local\programs\python\python313\lib\site-packages (2.0.45)
Requirement already satisfied: greenlet>=1 in c:\users\abhiraj\appdata\local\programs\python\python313\lib\site-packages (from sqlalchemy) (3.3.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\abhiraj\appdata\local\programs\python\python313\lib\site-packages (from sqlalchemy) (4.14.1)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.1.1 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
import sqlalchemy
import pandas as pd

In [5]:
engine = sqlalchemy.create_engine('mysql+pymysql://root:root@localhost:3306/application')

In [6]:
df = pd.read_sql_table("customers", engine)
df

   id    name  phone_number
0   1  Donald  7.326780e+09
1   2    Bill  6.573490e+09
2   3    Modi  4.567900e+09

In [7]:
# we can read one column also
df = pd.read_sql_table("customers", engine, columns=['name'])
df

     name
0  Donald
1    Bill
2    Modi

In [17]:
df = pd.read_sql_query("select id,name from customers",engine)
df

   id    name
0   1  Donald
1   2    Bill
2   3    Modi

In [8]:
# here we have written a sql query and run it in pandas
query ='''
SELECT customers.name, customers.phone_number, orders.name, orders.amount
FROM  customers INNER JOIN orders
ON customers.id = orders.customer_id
'''
df = pd.read_sql_query(query, engine)
df

     name  phone_number          name  amount
0    Bill  6.573490e+09      Yoga Mat    20.0
1  Donald  7.326780e+09  Google Pixel   950.0
2    Modi  4.567900e+09  Fossil Watch   120.0

In [9]:
# here we are going to load some excel data into our dataframes
df = pd.read_csv("customers.csv")
df

     Customer Name  Customer Phone
0     rafael nadal      4567895647
1  maria sharapova       434534545
2   vladimir putin        89345345
3      kim un jong       123434456
4       jeff bezos       934534543
5     rahul gandhi        44324222

In [23]:
# here now we are going to chage the col name so that it will match with our database name 


# here we are going to copy our excel file into sql dataset
df.rename(columns={
    'Customer Name': 'name',
    'Customer Phone': 'phone_number'
}, inplace = True)
df

     name
0  Donald
1    Bill
2    Modi

In [20]:
df = df.drop(columns=["id"])

In [22]:
df.to_sql(
    name = 'customers',
    con = engine,
    index = False,
    if_exists = 'append'
)

3